import numpy as np

# 0D ndim 張量                          #1D向量
x = np.array(12)
print('屬於', x.ndim, '階張量', x)

# 1D ndim 張量
x = np.array([13, 1, 3, 5, 9])  # 5D向量
print('屬於', x.ndim, '階張量', x)

# 2D ndim 張量
x = np.array([
    [13, 1, 3, 5, 9],
    [13, 1, 3, 5, 9],
    [13, 1, 3, 5, 9]])
print(x, '屬於', x.ndim, '階張量')

# 3D ndim 張量
x = np.array(
    [[[13, 1, 3, 5, 9],
      [13, 1, 3, 5, 9],
      [13, 1, 3, 5, 9]],
     [[13, 1, 3, 5, 9],
      [13, 1, 3, 5, 9],
      [13, 1, 3, 5, 9]],
     [[13, 1, 3, 5, 9],
      [13, 1, 3, 5, 9],
      [13, 1, 3, 5, 9]]
     ])
print(x, '屬於', x.ndim, '階張量')
